doc/old-stuff/simple.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	       "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"> 
<head>
<title>A simple example Org-mode file</title>

<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="A simple example Org-mode file"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-19 08:20:06 CEST"/>
<meta name="author" content="Thorsten Jolitz"/>
<meta name="description" content="nil"/>
<meta name="keywords" content="nil"/>
</head>
<body>
<div id="content">
<h1 class="title">A simple example Org-mode file</h1>

<div id="outline-container-1" class="outline-2"><form method=post action="http://localhost:8000/make-me-interactive-html">

<h2 id="sec-1">1&nbsp;&nbsp;<span class="selectbox"><select name:"simple-todo" size="1"><option value="1" selected>HOLD</option><option>TODO</option><option>NEXT</option><option>DONE</option><option>WAITING</option><option>CANCELLED</option><option>PHONE</option></select></span>&nbsp;This file has a top level heading&nbsp;&nbsp;&nbsp;<span class="textfield"><input type="text" name="simple-tag" size="10"maxlenght="20" value=":bar:WAITING:HOLD:"></input></span></h2>
<table border="0"><tr><td>html-button-value</td><td><input type="text" name="simple-prop"size="40" maxlength="80" value="Send edits"></input></td></tr><tr><td>html-form</td><td><input type="text" name="simple-prop"size="40" maxlength="80" value="http://localhost:8000/make-me-interactive-html"></input></td></tr></table><textarea class="textarea" name="simple-section"cols="80" rows="35">This heading has five components.  Lets see if we can edit all five
through the web interface.
1. task state, currently this is =TODO= lets change it to =DONE=.
2. a property, try to change the =iorg-property= from =foo= to =bar=.
3. tag, change the tag from =bar= to =foo=.
4. heading text, allow the heading text to be edited through the web interface.
5. body text, allow this text to be edited through the web interface

The five items listed about should be in rough order of difficulty.
So lets work through them in order.  The simplest should be changing
the task state.  We can start with a simple button on the final html
page next to the headline, the text of this button can be "finish",
and pressing it will change the TODO state in this Org-mode file on
the server to DONE.  The implementation should look like this...
- add a function to the `org-export-html-final-hook' which will scan
  through the resulting HTML and will add the html/JS necessary to
  include this button on the final web page.
- start an elnode server and add two different handlers, one will
  serve up this web page (with the above hook), and the second will
  handle the form data returned by the "finish" button.
- the second handler will use the `org-todo' function to change the
  actual state of the heading.

Once this is working we should have a much better idea of what is
required to make this process work end-to-end.  With luck we may have
some initial functionality by the end of next week (some number of the
above 5 parts being editable).

Lets keep all of the code implementing this in file:simple.el, once it
is written we can see what it look like and decide how to better
organize it into a directory structure which we'll want to keep for
the remainder of the iorg project.

I've stubbed out a few functions in file:simple.el, add new functions
as they are needed.
</textarea>
<table border=0>
<tr>
<td><input type="reset"></td>
<td><input type="submit" value="Send edits"></td>
</tr>
</table>
</form></div>

</div>
<div id="postamble">
<p class="date"> Date: 2012-06-19 08:20:06 CEST </p> 
<p class="author"> Author : Thorsten Jolitz</p>
<p class="creator"> Generated by Org mode 7.8.09 in Emacs 24.0.93.1. </p><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
